---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricWireItem.Dispose
source: html/3491856a-370c-af8f-ff50-76fec78a550a.htm
---
# Autodesk.Revit.DB.Structure.FabricWireItem.Dispose Method

Releases all resources used by the FabricWireItem

## Syntax (C#)
```csharp
public void Dispose()
```